# AnalyticalSupportChecking Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
AnalyticalSupportChecking Methods
AnalyticalSupportChecking Class See Also
---
The AnalyticalSupportChecking type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CheckMemberSupports | Check if the document contains unsupported Structural Elements. |

# See Also
AnalyticalSupportChecking Class
Autodesk.Revit.DB.Structure Namespace